export default
{ success: true, status: null, message: '查询各数据中心关系成功', errorMsg: null, data: { lines: [{ weight: true, source: '苏州政务数据中心', target: '苏州政务数据中心' }, { weight: true, source: '苏州政务数据中心', target: '苏州国科数据中心' }, { weight: true, source: '苏州政务数据中心', target: '苏州电信数据中心' }, { weight: true, source: '苏州政务数据中心', target: '苏州联通数据中心' }, { weight: true, source: '苏州政务数据中心', target: '昆山联通数据中心' }, { weight: true, source: '苏州政务数据中心', target: '广州灾备数据中心' }], points: [{ leader: true, name: '苏州政务数据中心', id: 3, position: '[0.60, 0.35]' }, { name: '苏州国科数据中心', id: 4, position: '[0.22, 0.48]' }, { name: '苏州电信数据中心', id: 5, position: '[0.59, 0.54]' }, { name: '苏州联通数据中心', id: 6, position: '[0.31, 0.67]' }, { name: '昆山联通数据中心', id: 7, position: '[0.71, 0.79]' }, { name: '广州灾备数据中心', id: 8, position: '[0.11, 0.93]' }] }, solution: null, failed: false }

export const points = [{
  name: '社会事业局',
  coordinate: [0.13, 0.28]
},
{
  name: '组织部',
  coordinate: [0.28, 0.35]
}, {
  name: '促进局',
  coordinate: [0.36, 0.32]
}, {
  name: '党工委',
  coordinate: [0.58, 0.26]
}, {
  name: '宣传部',
  coordinate: [0.67, 0.35]
}, {
  name: '环保局',
  coordinate: [0.84, 0.35]
},
{
  name: '金管局',
  coordinate: [0.52, 0.41]
}, {
  name: '创新局',
  coordinate: [0.34, 0.51]
}, {
  name: '社保局',
  coordinate: [0.30, 0.47]
}, {
  name: '规划局',
  coordinate: [0.44, 0.49]
}, {
  name: '政法委',
  coordinate: [0.23, 0.60]
},
{
  name: '行政审核局',
  coordinate: [0.14, 0.65]
}, {
  name: '经发委',
  coordinate: [0.26, 0.75]
}, {
  name: '教育局',
  coordinate: [0.43, 0.63]
}, {
  name: '工委会',
  coordinate: [0.39, 0.78]
}, {
  name: '纪工委',
  coordinate: [0.54, 0.65]
},
{
  name: '自贸区协调局',
  coordinate: [0.52, 0.82]
}, {
  name: '国资办',
  coordinate: [0.64, 0.57]
}, {
  name: '统战部',
  coordinate: [0.64, 0.78]
}, {
  name: '市监局',
  coordinate: [0.75, 0.55]
}, {
  name: '科信局',
  coordinate: [0.81, 0.74]
}]
export const dcList = [
  {
    id: 1,
    name: '政务云',
    vm: 256,
    mem: 345,
    cpu: 236,
    disk: 111,
    coordinate: [63641.82242120001, 46084.01155038807]
  },
  {
    id: 2,
    name: '华为云',
    vm: 256,
    mem: 345,
    cpu: 236,
    disk: 111,
    coordinate: [64219.04677438915, 39350.17290732433]
  },
  {
    id: 3,
    name: '天翼云',
    vm: 256,
    mem: 345,
    cpu: 236,
    disk: 111,
    coordinate: [60995.71651291201, 46481.45811653861]
  }
]
export const departList = [
  {
    id: 1,
    name: '莲花模块',
    coordinate: [65107.9281, 42188.9569]
  },
  {
    id: 2,
    name: '斜塘新镇',
    coordinate: [65059.8885, 43067.4086]
  },
  {
    id: 3,
    name: '唯亭开发区',
    coordinate: [72648.0591, 48377.7925]
  },
  {
    id: 4,
    name: '跨塘局',
    coordinate: [60554.7706, 48645.1495]
  },
  {
    id: 5,
    name: '东湖大郡',
    coordinate: [63732.4099,
      44311.1893
    ]
  },
  {
    id: 6,
    name: '唯亭北区',
    coordinate: [70934.0223,
      50360.1359
    ]
  },
  {
    id: 7,
    name: '通园路',
    coordinate: [58025.6981,
      41978.0444
    ]
  },
  {
    id: 8,
    name: '斜搪机房',
    coordinate: [65314.1004,
      43183.7428
    ]
  },
  {
    id: 9,
    name: '胜浦机房',
    coordinate: [73891.9749,
      43700.9531
    ]
  },
  {
    id: 10,
    name: '汀兰巷',
    coordinate: [69489.4969,
      47990.723
    ]
  },
  {
    id: 11,
    name: '唯亭机房',
    coordinate: [70654.9036,
      48657.8893
    ]
  },
  {
    id: 12,
    name: '东沙湖机房',
    coordinate: [66915.0107,
      47121.98
    ]
  },
  {
    id: 13,
    name: '跨塘机房',
    coordinate: [60822.0412,
      48583.6735
    ]
  },
  {
    id: 14,
    name: '苏春工业坊',
    coordinate: [71083.0815,
      46947.1462
    ]
  },
  {
    id: 15,
    name: '平门局',
    coordinate: [53107.4252,
      46316.0401
    ]
  },
  {
    id: 16,
    name: '南施街',
    coordinate: [64532.912,
      46066.7835
    ]
  },
  {
    id: 17,
    name: '北基站',
    coordinate: [58563.0253,
      46048.874
    ]
  },
  {
    id: 18,
    name: '车坊局',
    coordinate: [66508.2957,
      37204.8392
    ]
  },
  {
    id: 19,
    name: '城东局',
    coordinate: [57142.9324,
      41873.7599
    ]
  },
  {
    id: 20,
    name: '玲珑湾',
    coordinate: [61513.9581,
      46724.2755

    ]
  },
  {
    id: 21,
    name: '园区局',
    coordinate: [58381.3125,
      44023.7001

    ]
  },
  {
    id: 22,
    name: '腾飞机房',
    coordinate: [58986.4158,
      43889.0269
    ]
  }

]
export const lines = [
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [65107.9281, 42188.9569]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [65059.8885, 43067.4086]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [72648.0591, 48377.7925]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [60554.7706, 48645.1495]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [63732.4099, 44311.1893]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [70934.0223,
        50360.1359
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [58025.6981,
        41978.0444
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [65314.1004,
        43183.7428
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [73891.9749,
        43700.9531
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [69489.4969,
        47990.723
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [70654.9036,
        48657.8893
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [66915.0107,
        47121.98
      ]
    ]
  },

  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [60822.0412,
        48583.6735
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [71083.0815,
        46947.1462
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [53107.4252,
        46316.0401
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [64532.912,
        46066.7835
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [58563.0253,
        46048.874
      ]
    ]
  },
  {
    coords: [
      [63641.82242120001, 46084.01155038807],
      [64219.04677438915, 39350.17290732433]
    ]
  },
  {
    coords: [
      [64219.04677438915, 39350.17290732433],
      [63641.82242120001, 46084.01155038807]
    ]
  }
]
